Repository: montymobile1/montyesim-eshop-SDK-iOS
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, fr

# userGuideView.androidGuideSecondText
source: The built-in ability to scan QR codes automatically from the gallery on Samsung devices is a feature that was introduced with One UI 3.0, which is based on Android 11. This feature is available on Samsung devices that are running One UI 3.0 or later.
ar: إن القدرة المضمنة على مسح رموز الاستجابة السريعة تلقائيًا من المعرض في أجهزة Samsung ميزة تم تقديمها مع One UI 3.0، إذ تستند إلى Android 11. وتتوفر هذه الميزة في أجهزة Samsung التي تعمل بنظام One UI 3.0 أو إصدار أحدث.

# userGuideView.androidGuideSixthStep
source: Follow the prompts to install the eSIM and activate it for your device.
ar: اتبع التعليمات لتثبيت eSIM وتنشيطها في جهازك.

# userGuideView.androidGuideThirdStep
source: Tap on the image to open it.
ar: اضغط على الصورة لفتحها.

# userGuideView.androidGuideThirdText
source: However, availability of the feature may also depend on the specific model and variant of the device. For example, some older models may not have received the One UI 3.0 update, and therefore would not have the feature.
ar: ومع ذلك، قد يعتمد توفر الميزة أيضًا على الطراز المحدد والمتغير للجهاز. على سبيل المثال، ربما لم تتلق بعض الطرازات القديمة تحديث One UI 3.0، وبالتالي لن تحتوي على الميزة.

# valid
source: Valid {date}
ar: صالح لغاية {date}
fr: Valide jusqu’au {date}

source: Valid metadata is missing.
ar: البيانات الوصفية الصالحة مفقودة.

source: Validity
ar: صالح لغاية
fr: Validité

# validity_day
source: day
ar: يوم
fr: jour

# validity_day_plural
source: days
ar: أيام
fr: jours

# validity_month
source: month
ar: شهر
fr: mois

# validity_month_plural
source: months
ar: أشهر
fr: mois

# validity_week
source: week
ar: أسبوع
fr: semaine

# validity_week_plural
source: weeks
ar: أسابيع
fr: semaines

# validity_year
source: year
ar: سنة
fr: an

# validity_year_plural
source: years
ar: سنوات
fr: ans

# validity.title
source: Validity %@
ar: الصلاحية %@
fr: Validité %@

# verify.email.title
source: verify OTP
ar: تحقق من رقم

# verify.title
source: Verify
ar: تحقق

# verifyLogin_buttonTitleText
source: Verify Email
ar: التحقق من البريد الإلكتروني
fr: Vérifier l’e-mail

# verifyLogin_buttonTitleTextPhone
source: Verify Phone Number
ar: تحقق من رقم الهاتف
fr: Vérifier le numéro de téléphone

# verifyLogin_checkEmail
source: Didn't receive email?
ar: لم تستلم البريد الإلكتروني؟
fr: Vous n’avez pas reçu l’e-mail ?

# verifyLogin_checkPhone
source: Didn't receive OTP?
ar: لم تستلم رمز التحقق؟
fr: Vous n’avez pas reçu le code ?

# verifyLogin_contentText
source: We sent you a verification code to instantly sign-in
ar: لقد أرسلنا لك رمز التحقق لتسجيل الدخول على الفور
fr: Nous vous avons envoyé un code de vérification pour vous connecter instantanément

# verifyLogin_resendCode
source: Resend Code
ar: إعادة إرسال الرمز
fr: Renvoyer le code

# verifyLogin_titleText
source: Check your email
ar: تحقق من بريدك الالكتروني
fr: Vérifiez votre e-mail

# verifyLogin_titleTextPhone
source: Check your inbox
ar: تحقق من صندوق الوارد
fr: Vérifiez votre boîte de réception

# verifyLogin_wrongCode
source: Incorrect pin code, Please try again
ar: رمز PIN غير صحيح. يُرجى المحاولة مرة أخرى!
fr: Code PIN incorrect, veuillez réessayer

# verifyOrderOtp_contentText
source: You are about to pay using your airtime balance. A verification code was sent by sms
ar: أنت على وشك الدفع باستخدام رصيد الخاص بك. تم إرسال رمز التحقق عبر رسالة نصية قصيرة
fr: Vous êtes sur le point de payer avec votre solde. Un code de vérification a été envoyé par SMS

# verifyOrderOtp_titleText
source: Please verify your SMS
ar: يرجى التحقق من الرسالة النصية
fr: Veuillez vérifier votre SMS

# video_notadded
source: Could not add video input
ar: تعذّر إضافة مدخل الفيديو
fr: Impossible d’ajouter l’entrée vidéo

# ViewReceipt.title
source: View Receipt
ar: عرض الفاتورة
fr: Voir le reçu

source: Voucher Redeemed Successfully
ar: تم استخدام القسيمة بنجاح
fr: Bon utilisé avec succès

# Voucher.Code.title
source: Voucher Code
ar: كود القسيمة

# voucherCode_buttonText
source: Redeem
ar: استرداد
fr: Utiliser

# voucherCode_contentText
source: Enter the voucher code or scan the QR code to redeem into your eSIM wallet
ar: أدخل رمز القسيمة أو امسح رمز الاستجابة السريعة لاسترداده في محفظة eSIM
fr: Entrez le code du bon ou scannez le QR code pour l’ajouter à votre portefeuille eSIM

# voucherCode_placeHolderText
source: Voucher Code
ar: كود القسيمة
fr: Code du bon

# voucherCode_titleText
source: Redeem Voucher
ar: استرداد القسيمة
fr: Utiliser un bon

# wallet.title
source: Wallet
ar: محفظتي

# warning_title
source: Warning
ar: تحذير
fr: Avertissement

# welcome.message
source: Welcome to ESIM SDK
ar: مرحبا بك في اي سم

source: What do you want to do?
ar: ما الذي تريد عمله؟
fr: Que voulez-vous faire ?

source: yes
ar: نعم
fr: oui

# yes.title
source: Yes
ar: نعم

# YesLogout.title
source: Yes, Logout
ar: نعم، تسجيل الخروج

source: Yesterday
ar: أمس
fr: Hier

source: You are about to send
ar: أنت على وشك إرسال
fr: Vous êtes sur le point d’envoyer

# your.referral.code.title
source: Referral Code
ar: رمز ترويجي

# Active.title
source: Active
fr: Actif

# inActive.title
source: Inactive
fr: Inactif

source: Install
fr: Installer

# message.copied.title
source: Copied to clipboard
fr: Copié

source: Pin
fr: Code PIN

# qr_code_sent_to_your_email
source: The QR code was sent to your email. You scan it here and share it with your friends
fr: Le code QR a été envoyé à votre email. Vous pouvez le scanner ici et le partager avec vos amis
